### `terraform plan`
```
Terraform detected the following changes made outside of Terraform since the last "terraform apply" which may have affected this plan:

  # module.toucher_lambda.module.toucher_lambda.aws_lambda_function.main has changed
  ~ resource "aws_lambda_function" "main" {
        id                             = "editorial-photography-toucher-production"
      ~ last_modified                  = "2024-09-18T15:34:38.000+0000" -> "2024-11-14T11:21:12.000+0000"
      ~ memory_size                    = 128 -> 1024
        tags                           = {}
      ~ timeout                        = 300 -> 600
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.production_lambda.module.transfer_lambda.module.transfer_lambda.aws_lambda_function.main has changed
  ~ resource "aws_lambda_function" "main" {
      ~ code_sha256                    = "KP7ElpkDTP4eLxinBrFxFAGwwrxT/YdlPInh5lza6ps=" -> "r3LsJnz/K44ga6i6EGpXdFdL/7u1tCe8Tdez9a971l0="
        id                             = "editorial-photography-transfer-production"
      ~ last_modified                  = "2024-10-22T16:04:45.000+0000" -> "2025-02-17T09:00:12.000+0000"
      ~ memory_size                    = 2048 -> 4096
      ~ source_code_size               = 61128 -> 61129
        tags                           = {}
      ~ timeout                        = 600 -> 900
        # (23 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the relevant attributes using ignore_changes, the following plan may include actions to
undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.restorer_lambda.module.restore_lambda.aws_lambda_function.main will be updated in-place
  ~ resource "aws_lambda_function" "main" {
        id                             = "editorial-photography-transfer-restorer"
      ~ last_modified                  = "2024-10-22T16:05:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "9m3lSNAEZUw3Kv3inFGkB/VEw97fUJTSQbcT66NFSi0=" -> "hLer1kI/YGlScOZjo44P08qz4aC9/POv9jPK4MHmeYc="
        tags                           = {}
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.toucher_lambda.module.toucher_lambda.aws_lambda_function.main will be updated in-place
  ~ resource "aws_lambda_function" "main" {
        id                             = "editorial-photography-toucher-production"
      ~ last_modified                  = "2024-11-14T11:21:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "yJ+PHXAMrs/Z0CSReLPGD9Maht5F+uBTdiB5p9+ArdI=" -> "irEktyhyv8TsJ+YKxK3gTw9bq8waz4SzpD45aGskBVY="
        tags                           = {}
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.transfer_throttle.module.transfer_scheduler.aws_cloudwatch_event_rule.schedule_rule will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "schedule_rule" {
      ~ description         = "Moves batches of shoots to the transferer at a rate Archivematica can handle" -> "Moves batches of shoots to the transferrer at a rate Archivematica can handle"
        id                  = "transfer_throttle_schedule"
        name                = "transfer_throttle_schedule"
        tags                = {}
        # (9 unchanged attributes hidden)
    }

  # module.production_lambda.module.transfer_lambda.module.transfer_lambda.aws_lambda_function.main will be updated in-place
  ~ resource "aws_lambda_function" "main" {
        id                             = "editorial-photography-transfer-production"
      ~ last_modified                  = "2025-02-17T09:00:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "var.source_code_hash" -> "hLer1kI/YGlScOZjo44P08qz4aC9/POv9jPK4MHmeYc="
        tags                           = {}
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.staging_lambda.module.input_queue.module.input_queue.data.aws_iam_policy_document.read_from_queue will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "read_from_queue" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:ChangeMessageVisibility",
              + "sqs:ChangeMessageVisibilityBatch",
              + "sqs:DeleteMessage",
              + "sqs:ReceiveMessage",
            ]
          + resources = [
              + "arn:aws:sqs:eu-west-1:404315009621:transfer-shoots-staging",
            ]
        }
    }

  # module.staging_lambda.module.input_queue.module.input_queue.aws_sqs_queue.q will be updated in-place
  ~ resource "aws_sqs_queue" "q" {
        id                                = "https://sqs.eu-west-1.amazonaws.com/404315009621/transfer-shoots-staging"
        name                              = "transfer-shoots-staging"
        tags                              = {}
      ~ visibility_timeout_seconds        = 640 -> 9000
        # (18 unchanged attributes hidden)
    }

  # module.staging_lambda.module.transfer_lambda.module.transfer_lambda.aws_lambda_function.main will be updated in-place
  ~ resource "aws_lambda_function" "main" {
        id                             = "arn:aws:lambda:eu-west-1:404315009621:function:editorial-photography-transfer-staging"
      ~ last_modified                  = "2024-07-17T14:40:54.000+0000" -> (known after apply)
      ~ memory_size                    = 2048 -> 4096
      ~ source_code_hash               = "9m3lSNAEZUw3Kv3inFGkB/VEw97fUJTSQbcT66NFSi0=" -> "hLer1kI/YGlScOZjo44P08qz4aC9/POv9jPK4MHmeYc="
        tags                           = {}
      ~ timeout                        = 300 -> 900
        # (24 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 0 to add, 6 to change, 0 to destroy.
```